["Answer Key: Logic & Critical Thinking\nMidterm Examination (Chapters 1 & 2)\nPrepared for: Sumeya Abdellah\nPart I: Multiple Choice Questions (60 pts)\nNo. Ans Explanation Reference\n1 B Philosophy is constructive because it attempts to formulate ratio- Page 14\nnally defensible answers to fundamental questions.\n2 B ”Since” is listed as a typical premise indicator word. Page 46\n3 C Raising fundamental questions about existence characterizes the Page 12-13\nSocratic sense of wonder/wisdom.\n4 B A valid argument is defined by the impossibility of having true Page 74\npremises and a false conclusion.\n5 C AppliedEthicsdealswithspecificmoralproblemslikecapitalpun- Page 29\nishment or abortion.\n6 B Predictions about the future based on past events are inductive Page 71\narguments.\n7 B Empiricism is the view that knowledge is obtained through the Page 23\nsenses.\n8 A ”Because” and ”furthermore” indicate the reasons; ”You should Page 45\navoid...” is the main point (conclusion).\n9 C Philosophy is dynamic and critical, not a set of static, authorita- Page 16\ntive, or final beliefs.\n10 B Even if premises are true, the conclusion (cats are dogs) is false; Page 76\nthis combination makes it Invalid.\n11 B Socrates emphasized critical self-examination of one’s life and val- Page 31\nues.\n12 B Strengthmeansitisimprobable(notimpossible)fortheconclusion Page 79\nto be false if premises are true.\n13 A Ontology studies the nature of existence (matter vs spirit, reality Page 22\nvs appearance).\n14 B Non-argumentative passages (like advice or reports) lack an infer- Page 52\nential claim (reasoning process).\n15 A Philosophy helps develop one’s own beliefs/worldview, leading to Page 32\nintellectual independence.\n16 A A sound argument must be valid AND have all true premises. Page 78\n17 B Philosophical wisdom is a critical habit and vigilance, not just Page 13\ntechnical expertise.\n18 B Theargumentappliesageneralrule(categorical)toaspecificcase; Page 69\nCategorical Syllogisms are deductive.\n19 B Meta-ethics investigates the meaning of ethical terms and sources Page 28\nof ethical principles.\n1", "Jimma University Answer Key & Explanations\nNo. Ans Explanation Reference\n20 B A statement must be a declarative sentence capable of being true Page 42\nor false.\n21 C Free will vs. determinism is a core question of the Anthropological Page 21\naspect of Metaphysics.\n22 A Argumentsbasedonpurearithmeticorgeometriccomputationare Page 69\ndeductive.\n23 B Russellstatedthevalueofphilosophyliesinitsuncertainty,freeing Page 33\nus from dogmatism.\n24 B The form is valid, but since the premises are false, it is Valid but Page 78\nUnsound.\n25 C Skepticism claims people cannot acquire reliable knowledge and Page 23\nthe search for truth is in vain.\n26 D Arguments from analogy (comparing similarities) are probabilistic Page 71\nand thus Inductive.\n27 C An argument requires a group of statements with at least one Page 43\npremise and one conclusion.\n28 C Intuitionisdirectapprehensionnotderivedfromconsciousreason- Page 25\ning or sense perception.\n29 B A cogent argument must be Strong AND have all true premises. Page 83\n30 C ”Doing” philosophy involves reflecting on and criticizing deeply Page 15\nheld conceptions.\n31 A Arguments based on signs (visual cues) are Inductive. Page 71\n32 C QuestionsaboutgovernmentbelongtoSocial/PoliticalPhilosophy, Page 30\nnot Aesthetics.\n33 A In ”If... then...”, the first part is the Antecedent (if-clause). Page 59\n34 B The premise (Most people) provides probabilistic support, but the Page 81\nlink is weak given the context.\n35 B Metaphysics asks ”What is reality?” vs ”What is appearance?”. Page 20\n36 B Unlike validity (all or nothing), strength admits degrees (more or Page 81\nless probable).\n37 B A is the Antecedent, B is the Consequent. Page 59\n38 C A valid argument CAN have false premises (Unsound). It cannot Page 77\nhave T premises and F conclusion.\n39 B Logic studies the principles of right reasoning/arguments, not the Page 40\npsychological process.\n40 B To be Cogent, it must be Strong. If it is Weak, it is automatically Page 83\nUncogent.\n41 C An argument can exist without indicator words (implied infer- Page 47\nence); other options are mandatory.\n42 A Obligations to the State and laws are central to Social/Political Page 30\nPhilosophy.\n43 C Statistical arguments (99%) are inductive, and 99% is very high Page 71\nprobability, making it Strong.\n44 B ”Necessarily” indicates the arguer claims the conclusion follows Page 67\nwith certainty (Deduction).\n45 C Having T premises and T conclusion implies nothing about the Page 76\nlink. It could be valid or invalid.\n46 B Explanations assume the event happened (fact) and give reasons Page 57\n*why*; Arguments try to prove *that* it is true.\nPage 2", "Jimma University Answer Key & Explanations\nNo. Ans Explanation Reference\n47 B Philosophy intensifies self-awareness by examining the intellectual Page 32\ngrounds of our lives.\n48 C Cogency requires the ”Total Evidence Requirement” (not sup- Page 83\npressing important facts).\n49 B Deductive arguments claim the conclusion follows with necessity Page 64\n(impossibility of falsehood).\n50 D Uncogent = Weak OR Strong with False Premises. So both B and Page 83\nC make it Uncogent.\n51 B Relying on the testimony of an expert/authority is an Inductive Page 71\nargument.\n52 B Inductive strength relies on the probabilistic support (content), Page 81\nnot just structure.\n53 A The form is Valid and the premises are actually True. Thus, it is Page 78\nSound.\n54 A Drawing a conclusion about the next instance based on past sam- Page 71\nples is Generalization (Inductive).\n55 B Soundness requires Validity. If it is Invalid, it cannot be Sound. Page 79\n56 B While not explicitly in the text, Apologetics historically defends Page 21\nreligious doctrine (Theological aspect).\n57 B Necessary reasoning (certainty) is the hallmark of Deduction. Page 64\n58 A Comparing Calculus to Physics based on similarity (Math require- Page 71\nment) is Analogy.\n59 B Validity deals with the link. If premises are false, it fails the truth Page 79\ncondition for Soundness.\n60 B Logic is the science that evaluates arguments (good vs bad reason- Page 39\ning).\nPart II: Fill in the Blank (15 pts)\n1. Wisdom (Page 13)\n2. Epistemology (Page 22)\n3. Statement (or Proposition) (Page 42)\n4. Conclusion (Page 43)\n5. Logic (Page 37)\n6. Deductive (Page 64)\n7. Inductive (Page 65)\n8. Sound (Page 78)\n9. Cogent (Page 83)\n10. Conclusion (Page 45)\n11. Premise (Page 46)\n12. Axiology (Page 27)\n13. Consequent (Page 59)\nPage 3", "Jimma University Answer Key & Explanations\n14. Analogy (Page 71)\n15. Inferential (Page 49)\nPart III: Short Answer (15 pts)\n1. Metaphysics vs. Axiology: Metaphysics studies ultimate reality and existence (God, mind,\nmatter), while Axiology studies values (ethics/goodness and aesthetics/beauty). (Page 19/27)\n2. Benefits of Logic: 1) Skills to evaluate arguments, 2) Defense against propaganda/prejudice,\n3) Distinguishing good from bad reasoning. (Page 41)\n3. Conditional Statement: It is not an argument because it does not assert that the antecedent\nis true; it only claims a relationship (”If X, then Y”), lacking a factual claim. (Page 60)\n4. Valid vs. Sound: AValidargumenthasacorrectstructure(conclusionfollowsfrompremises),\nwhereas a Sound argument is Valid AND has actually true premises. (Page 78)\n5. Argument vs. Illustration: An argument tries to prove *that* something is true; an illus-\ntration provides examples to show *how* something is done or what it means. (Page 56)\n6. Deduction vs. Induction: Deductiveargumentsclaimtheconclusionfollowswith*necessity*\n(certainty); Inductive arguments claim the conclusion follows with *probability*. (Page 64/65)\n7. Valid Deductive Ex: All humans are mortal. Sumeya is human. Therefore, Sumeya is mortal.\n(Page 65)\n8. Strong Inductive Ex: Most university students are hard workers. Sumeya is a university\nstudent. Therefore, Sumeya is probably a hard worker. (Page 66)\n9. True Premises/Conclusion but Invalid: Validity depends on the *link*. If the premises are\ntrue and conclusion is true, but the premises don’t *cause* the conclusion (e.g., ”Grass is green.\nSugar is sweet.”), it is invalid. (Page 76)\n10. Explanandum vs. Explanans: Explanandum is the event being explained (the fact); Ex-\nplanans is the statement doing the explaining (the reason). (Page 57)\n11. Skepticism: The epistemological position claiming that people cannot acquire reliable knowl-\nedge and that the search for truth is in vain. (Page 23)\n12. InferentialClaim: Theclaimthatthepassageexpressesareasoningprocess—thatthepremises\nsupport or imply the conclusion. (Page 50)\n13. Empiricism vs. Rationalism: Empiricism claims knowledge comes from sense experience;\nRationalism claims knowledge comes from reason/thought. (Page 23/24)\n14. Reports: They convey information about a topic but do not claim that the statements support\nor imply a conclusion (no inferential claim). (Page 54)\n15. Weak Argument: It implies that even if the premises are assumed to be true, they do not\nmake the conclusion probable (the support is insufficient). (Page 81)\nPage 4"]